# Tidy Data Tidy Code

The tidyverse is a collection of open source R packages introduced by Hadley Wickham and his team that "share an underlying design philosophy, grammar, and data structures" of tidy data. The tidyverse was developed to give you the R developer the power to create pipelines of multi-levels of complexity that are able to perform various transformations on your data, while providing a way to create readable, scalable & maintainable code.

One of the core principles of the tidyverse is "Tidy input tidy output". Which means that the tidyverse tools operate on the tidy form of data (they have tools that can tidy it), this ensures a structured flow of data across multiple proccesses. So to understand the tidyverse, we have to take a look on "What's tidy data?". We will be exploring "Tidy Data" published by Hadley Wickham on the Journal of Statistical Software.

## Tidy Data

Hadley starts by citing the book of Tamraparni Dasu & Theodore Johnson "Exploratory Data Mining and Data Cleaning" that says data professionals spend nearly 80% of their time on cleaning & tidying data. Data preparation is not just a first step, but must be repeated many over the course of analysis as new problems come to light or new data is collected. The principles of tidy data are closely tied to those of relational databases and Coddâ€™s relational algebra, but are framed in a language familiar to statisticians.

The principles are as follows :
* Each cell contains only one value
* Each column contains only one variable
* Each row describes only one record
* Each table is dedicated to only one entity

Tidy data principles are no rocket science. However, the problem comes from the process of transforming messy data to tidy data, not tidy data or dealing with it at all. The great Tolstoy once said "All happy families are alike, but every unhappy family is unhappy in its own way". We can project this quote on our topic perfectly. The problem with tidying data is that all tidy data is layed-out the same. However, there is alot of forms & reasons to have your data messy. Thus, tidying data is a wide process that includes several transformation types under its umbrella. Let's demonstrate the cases that Hadley highlighted in his research.

### The fraud detection example

We will start by solving a little mystery. We need your help suggesting one data transformation that can help us identifying a fraud who uses fake identities to handle transactions within our system. Observe the following data table, pause for a while & try to think of that one move to check mate that fraud!!

In [1]:
Name <- c("Darryl Philibin", "James Halpbert", "Creed Bratton", "William Charles Schenider", "Oscar Martinez")
work_phone <- c("01612734539", "01789303913", "01616188156", "01791954312", "01623409065")
home_phone <- c("01698423618", "01790046612", "01791954312", "01616188156", "01699923176")

example_data <- data.frame(Name, work_phone, home_phone)
example_data

  Name                      work_phone  home_phone
1 Darryl Philibin           01612734539 01698423618
2 James Halpbert            01789303913 01790046612
3 Creed Bratton             01616188156 01791954312
4 William Charles Schenider 01791954312 01616188156
5 Oscar Martinez            01623409065 01699923176

One of the hints to an identity fraund, is information repition. As for one person, resources are limited, you can only get a home phone & a work phone. Thus, finding cross-columns repition can be a sign of mischief!!!. We will attempt a data transformation trick to ease the search for us.

In [2]:
tidyr::pivot_longer(example_data, !Name, values_to = 'phone number', names_to = 'phone_type')

   Name                      phone_type phone number
1  Darryl Philibin           work_phone 01612734539
2  Darryl Philibin           home_phone 01698423618
3  James Halpbert            work_phone 01789303913
4  James Halpbert            home_phone 01790046612
5  Creed Bratton             work_phone 01616188156
6  Creed Bratton             home_phone 01791954312
7  William Charles Schenider work_phone 01791954312
8  William Charles Schenider home_phone 01616188156
9  Oscar Martinez            work_phone 01623409065
10 Oscar Martinez            home_phone 01699923176

### Messy data symptoms

Here we will demonstrate the top five messy data symptoms Hadley Wickham talked about in his paper.

* Column Headers as values
| City | Temp > 15 | Temp > 30 | Temp > 45 |
| --- | --- | --- | --- |
| Cairo | 0 | 0 | 1 |

* Multiple variables stored in a column
| Name | Attribute |
| --- | --- |
| Jim | 75 kg |
| Jim | 181 cm |
| Jim | 23 years |

* Variables are stored in both rows and columns (one cell carriestwo values)
| Name | Age - Gender |
| --- | --- |
| Jim | 23 - Male |
| Angela | 28 - Female |

* Multiple types in one table
* A single unit stored in multiple tables

## Tidyverse

Now, we will demonstrate the core packages of the tidyverse. The tidyverse includes 25 packages, today we will demonstrate four of the core packages, we will leave ggplot2 for the next lecture. The packages we are going to showcase them today are tidyr, dplyr, purrr & stringr. Keep in mind the main principle of the tidyverse "Tidy input Tidy output".

### 1) tidyr

You already saw this package in action, tidyr provides a set of functions that help you get to tidy data. Tidy data is data with a consistent form: in brief, every variable goes in a column, and every column is a variable. We will demonstrate the two most important functions of tidyr; pivot_longer & pivot_wider. Both of those functions focus on changing the data layout from long to wide. Both of those layouts can be tidy, but probably one of them is more useful to you depending on the context. Note : the older versions of those functions are gather() & spread() their code isn't going away but is no longer under active development.

In [3]:
options(readr.num_columns = 0)
library(tidyverse)
gapminder_income_data <- read_csv('data/income_data.csv')
names(gapminder_income_data) <- as.character(names(gapminder_income_data))

-- Attaching packages --------------------------------------- tidyverse 1.3.0 --
v ggplot2 3.3.3     v purrr   0.3.4
v tibble  3.0.6     v dplyr   1.0.4
v tidyr   1.1.2     v stringr 1.4.0
v readr   1.4.0     v forcats 0.5.1
-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

In [4]:
subset <- gapminder_income_data[1:10,1:5]
head(subset)

  country              1800 1801 1802 1803
1 Afghanistan           603  603  603  603
2 Angola                618  620  623  626
3 Albania               667  667  667  667
4 Andorra              1200 1200 1200 1200
5 United Arab Emirates  998 1000 1010 1010
6 Argentina            1640 1640 1650 1650

In [5]:
subset_long <- subset %>%
                    pivot_longer(!country, names_to = 'year', values_to = 'incomeUSD')
head(subset_long,10)

   country     year incomeUSD
1  Afghanistan 1800 603
2  Afghanistan 1801 603
3  Afghanistan 1802 603
4  Afghanistan 1803 603
5  Angola      1800 618
6  Angola      1801 620
7  Angola      1802 623
8  Angola      1803 626
9  Albania     1800 667
10 Albania     1801 667

In [6]:
subset_wide <- subset_long %>%
                    pivot_wider( names_from = 'year', values_from = 'incomeUSD')
head(subset_wide) #reverted

  country              1800 1801 1802 1803
1 Afghanistan           603  603  603  603
2 Angola                618  620  623  626
3 Albania               667  667  667  667
4 Andorra              1200 1200 1200 1200
5 United Arab Emirates  998 1000 1010 1010
6 Argentina            1640 1640 1650 1650

### 2) dplyr

The dplyr package ovides a grammar of data manipulation, providing a consistent set of verbs that solve the most common data manipulation challenges. It is your top tool for subseting, filtering, grouping & summarizing data; you can construct pipelines starting from basic statistics till sophisticated data manipulation pipelines. It's better to view dplyr as R's representative of SQL. We will observe together how dplyr manages to do the tasks you usually do with SQL so that you can understand the whats & whys of dplyr from the SQL context you are all familiar with.

In [7]:
options(warn = -1)
library(sqldf) #SQL commands in R
library(dplyr)

Loading required package: gsubfn
Loading required package: proto
Loading required package: RSQLite

In [8]:
sqldf("select * from subset_long limit 3") # getting first 3 rows with sql in r

  country     year incomeUSD
1 Afghanistan 1800 603
2 Afghanistan 1801 603
3 Afghanistan 1802 603

In [9]:
sql_result <- sqldf("SELECT country, AVG(`1801`) as AVG1801
                    FROM subset
                    WHERE country LIKE 'A%'
                    GROUP BY country
                    ORDER BY AVG1801 DESC
                    LIMIT 5")
sql_result

  country             AVG1801
1 Austria             1850
2 Argentina           1640
3 Andorra             1200
4 Australia            822
5 Antigua and Barbuda  757

In [10]:
dplyr_result <- subset %>%
            select(country, `1801`) %>% 
                filter(startsWith(country,'A'))%>%
                        group_by(country) %>%
                            summarize(AVG1801 = mean(`1801`)) %>%
                                arrange(-AVG1801) %>%
                                    slice_head(n = 5)
dplyr_result

  country             AVG1801
1 Austria             1850
2 Argentina           1640
3 Andorra             1200
4 Australia            822
5 Antigua and Barbuda  757

In [11]:
as.logical(mean(sql_result == dplyr_result))

[1] TRUE

### 3) purr

purrr enhances Râ€™s functional programming (FP) toolkit by providing a complete and consistent set of tools for working with functions and vectors. Once you master the basic concepts, purrr allows you to replace many for loops with code that is easier to write and more expressive. Let's start by mappers, we have gave a qucik introduction to mappers the last lecture. We talked on their functionality & how they are a better alternative to looping (according to FP). We will take a look on purrr's mappers. Keep in mind that they are more efficient & usable than baseR mappers.

In [12]:
library(purrr)

#general purpose mappers
map(c(4,9,16),sqrt) #with vectors

random_list <- list("Jim", 23, FALSE)
map(random_list, is.character) #with lists

ages <- list(c(1,1,5),c(2,2,5),c(3,3,5))
map(ages,3) #with lists of vectors, can be used for indexing

map(subset_long,3) #with data frames; data frame === list of vectors

[[1]]
[1] 2

[[2]]
[1] 3

[[3]]
[1] 4

[[1]]
[1] TRUE

[[2]]
[1] FALSE

[[3]]
[1] FALSE

[[1]]
[1] 5

[[2]]
[1] 5

[[3]]
[1] 5

$country
[1] "Afghanistan"

$year
[1] "1802"

$incomeUSD
[1] 603

map() always returns a list, even if all the elements have the same flavor and are of length one. But in that case, you might prefer a simpler object: an atomic vector.

If you expect map() to return output that can be turned into an atomic vector, it is best to use a type-specific variant of map(). This is more efficient than using map() to get a list and then simplifying the result in a second step. Also purrr will alert you to any problems, i.e. if one or more inputs has the wrong type or length.

In [13]:
#type specific mappers
roots <- map_dbl(c(4,9,16),sqrt)
is.vector(roots)
class(roots)
roots

map_chr(list(c('A','B','D'),c('E','F','G'),c('H','I','J')),2)

# map_int, map_lgl

[1] TRUE

[1] "numeric"

[1] 2 3 4

[1] "B" "F" "I"

### 4) stringr

stringr provides a cohesive set of functions designed to make working with strings as easy as possible. It is built on top of stringi, which uses the ICU C library to provide fast, correct implementations of common string manipulations.

There are four main families of functions in stringr:

* Character manipulation: these functions allow you to manipulate individual characters within the strings in character vectors.

* Whitespace tools to add, remove, and manipulate whitespace.

* Locale sensitive operations whose operations will vary from locale to locale.

* Pattern matching functions. These recognise four engines of pattern description. The most common is regular expressions, but there are three other tools.

In [2]:
library(stringr)

# Character manipulation

string <- "This is a string"

str_length(string)
string %>% str_sub(2,-4) # From second character to 4th last character slicing

# White spaces
padded_string <- "         This is a string               "
padded_string
str_trim(padded_string)

[1] 16

[1] "his is a str"

[1] "         This is a string               "

[1] "This is a string"

In [3]:
#Sensitivity
str_to_upper(string)
str_to_lower(string)
str_to_title(string)

[1] "THIS IS A STRING"

[1] "this is a string"

[1] "This Is A String"

In [5]:
#Order & sorting
chars <- c('C','A','B')
str_sort(chars)

[1] "A" "B" "C"

In [6]:
#Pattern recognition

phone_number_pattern <- "[0-9]{11}" #regular expression
strings <- c("Michael Gary Scott",
            "Scranton, Pennsylvania",
            "01644422289",
            "01788832341",
            "Regional Manager")

str_detect(strings,phone_number_pattern) #Detection
str_subset(strings,phone_number_pattern) #Subsetting
str_count(strings,phone_number_pattern)  #counting
data.frame(strings,str_locate(strings,phone_number_pattern)) #exact locations
str_replace(strings, phone_number_pattern, "This was a phone number") #replacment

[1] FALSE FALSE  TRUE  TRUE FALSE

[1] "01644422289" "01788832341"

[1] 0 0 1 1 0

  strings                start end
1 Michael Gary Scott     NA    NA
2 Scranton, Pennsylvania NA    NA
3 01644422289             1    11
4 01788832341             1    11
5 Regional Manager       NA    NA

[1] "Michael Gary Scott"      "Scranton, Pennsylvania"
[3] "This was a phone number" "This was a phone number"
[5] "Regional Manager"

## More details

The world of tidyverse is far-reaching & wide-ranging, here we will mention interesting datacamp courses for each concept we talked about today. They are all bonus over your mandatory course for this session, so no pressure to do them. They are just for more practice & setting a deeper foot into the topic.

Courses : 
* [Working with Data in the Tidyverse](https://learn.datacamp.com/courses/working-with-data-in-the-tidyverse)
* [Reshaping Data with tidyr](https://learn.datacamp.com/courses/reshaping-data-with-tidyr)
* [Data Manipulation with dplyr](https://learn.datacamp.com/courses/data-manipulation-with-dplyr)
* [Foundations of Functional Programming with purrr](https://learn.datacamp.com/courses/foundations-of-functional-programming-with-purrr)
* [String Manipulation with stringr in R](https://learn.datacamp.com/courses/string-manipulation-with-stringr-in-r)

**Prepare to the next session (optional too)**

[Introduction to Data Visualization with ggplot2](https://learn.datacamp.com/courses/introduction-to-data-visualization-with-ggplot2)

## Challenge !!

[Gapminder](https://www.gapminder.org/data/) is one of the largest websites that provide a data collection tool on international data that is concerned with education, income, health, social studies..etc. It has one problem, it provides un-tidy data that needs some reshape & processing to obtain a useful dataset. Your mission is to download data for different related indicators, tidy the downloaded data & join them together to complete one useful dataset from which we can extract insights. You may try plotting different relations between the indicators you chose to give us an insight. Good Luck!